<a href="https://colab.research.google.com/github/kaushanr/python3-docs/blob/main/Section_35.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Python + SQL

In [ ]:
# SQL basics

  # SQLITE3 used in this  - https://www.sqlite.org/index.html

  # Creating tables

    # SQL command syntax usually provided in UPPERCASE - LOWERCASE reserved for data

#help(sqlite3)

# External references on Colab SQL syntax with SQLalchemy interfacing:

    # https://colab.research.google.com/github/tdmdal/mma-sql-2021/blob/master/docs/SQL_Intro_Sqlite.ipynb#scrollTo=3JdLzIG-P5iE

#### SQLite Terminal on Colab

---

In [ ]:
#!pip install ipython-sql

In [5]:
%load_ext sql

In [ ]:
%reload_ext sql

In [ ]:
%%sql
sqlite:///basics.db

'Connected: @basics.db'

In [ ]:
%%sql
SELECT sqlite_version();

 * sqlite:///basics.db
Done.

[('3.22.0',)]

In [ ]:
%%sql 

-- %%sql cell magic, %sql line magic

CREATE TABLE IF NOT EXISTS dog(name TEXT, breed TEXT, age INTEGER);
INSERT INTO dog VALUES ('Doggo','Husky',4);
SELECT * FROM dog;

 * sqlite:///basics.db
Done.
1 rows affected.
Done.

[('Doggo', 'Husky', 4)]

In [ ]:
%sql CREATE TABLE IF NOT EXISTS cat(name TEXT, breed TEXT, age REAL);
%sql INSERT INTO cat VALUES ('blue','scottish fold',3),('jet','bombay',0.3);
a = %sql SELECT * FROM cat;
print(a)

 * sqlite:///basics.db
Done.
 * sqlite:///basics.db
2 rows affected.
 * sqlite:///basics.db
Done.
+------+---------------+-----+
| name |     breed     | age |
+------+---------------+-----+
| blue | scottish fold | 3.0 |
| jet  |     bombay    | 0.3 |
+------+---------------+-----+

In [ ]:
%%sql 
SELECT name FROM sqlite_master WHERE type ='table' AND name NOT LIKE 'sqlite_%'; -- commenting on sql

 * sqlite:///basics.db
Done.

[('dog',), ('cat',)]

In [ ]:
%%sql

INSERT INTO dog (name,breed,age) VALUES ('Rose','Chihuahua',11);
INSERT INTO dog (name,breed,age) VALUES ('Moose','Lab',5);
INSERT INTO dog (name,breed,age) VALUES ('Champ','Husky',4);
INSERT INTO dog (name,breed,age) VALUES ('Piggy','Corgi',9);

 * sqlite:///basics.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
a = %sql SELECT * FROM dog;
print(a)

 * sqlite:///basics.db
Done.
+-------+-----------+-----+
|  name |   breed   | age |
+-------+-----------+-----+
| Doggo |   Husky   |  4  |
|  Rose | Chihuahua |  11 |
| Moose |    Lab    |  5  |
| Champ |   Husky   |  4  |
| Piggy |   Corgi   |  9  |
+-------+-----------+-----+

In [ ]:
a = %sql SELECT name,age FROM dog; -- SELECT takes in specified columns
print(a)

 * sqlite:///basics.db
Done.
+-------+-----+
|  name | age |
+-------+-----+
| Doggo |  4  |
|  Rose |  11 |
| Moose |  5  |
| Champ |  4  |
| Piggy |  9  |
+-------+-----+

In [ ]:
%%sql

INSERT INTO dog (name,breed,age) VALUES ('Maggie','Terrier',4);
INSERT INTO dog (name,breed,age) VALUES ('River','Husky',7);
INSERT INTO dog (name,breed,age) VALUES ('Archer','Pitbull',8);
INSERT INTO dog (name,breed,age) VALUES ('Pam','Pug',2);

 * sqlite:///basics.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [ ]:
a = %sql SELECT * FROM dog;
print(a)

 * sqlite:///basics.db
Done.
+--------+-----------+-----+
|  name  |   breed   | age |
+--------+-----------+-----+
| Doggo  |   Husky   |  4  |
|  Rose  | Chihuahua |  11 |
| Moose  |    Lab    |  5  |
| Champ  |   Husky   |  4  |
| Piggy  |   Corgi   |  9  |
| Maggie |  Terrier  |  4  |
| River  |   Husky   |  7  |
| Archer |  Pitbull  |  8  |
|  Pam   |    Pug    |  2  |
+--------+-----------+-----+

In [ ]:
a = %sql SELECT * FROM dog WHERE name IS 'Piggy';
print(a)

a = %sql SELECT * FROM dog WHERE breed IS 'Husky';
print(a)

a = %sql SELECT name FROM dog WHERE breed IS 'Husky';
print(a)

a = %sql SELECT * FROM dog WHERE breed IS NOT 'Chihuahua';
print(a)

a = %sql SELECT * FROM dog WHERE breed IS NOT 'Chihuahua' AND breed IS NOT 'Terrier' AND breed IS NOT 'Pug'; -- deMorgan's boolean inversion
print(a)

a = %sql SELECT * FROM dog WHERE age > 5;
print(a)

a = %sql SELECT * FROM dog WHERE name LIKE '%gg%'; -- %chars% represents any characters before and after
print(a)

 * sqlite:///basics.db
Done.
+-------+-------+-----+
|  name | breed | age |
+-------+-------+-----+
| Piggy | Corgi |  9  |
+-------+-------+-----+
 * sqlite:///basics.db
Done.
+-------+-------+-----+
|  name | breed | age |
+-------+-------+-----+
| Doggo | Husky |  4  |
| Champ | Husky |  4  |
| River | Husky |  7  |
+-------+-------+-----+
 * sqlite:///basics.db
Done.
+-------+
|  name |
+-------+
| Doggo |
| Champ |
| River |
+-------+
 * sqlite:///basics.db
Done.
+--------+---------+-----+
|  name  |  breed  | age |
+--------+---------+-----+
| Doggo  |  Husky  |  4  |
| Moose  |   Lab   |  5  |
| Champ  |  Husky  |  4  |
| Piggy  |  Corgi  |  9  |
| Maggie | Terrier |  4  |
| River  |  Husky  |  7  |
| Archer | Pitbull |  8  |
|  Pam   |   Pug   |  2  |
+--------+---------+-----+
 * sqlite:///basics.db
Done.
+--------+---------+-----+
|  name  |  breed  | age |
+--------+---------+-----+
| Doggo  |  Husky  |  4  |
| Moose  |   Lab   |  5  |
| Champ  |  Husky  |  4  |
| Piggy  |  Corgi  |  9  |
| River  |  Husky  |  7  |
| Archer | Pitbull |  8  |
+--------+---------+-----+
 * sqlite:///basics.db
Done.
+--------+-----------+-----+
|  name  |   breed   | age |
+--------+-----------+-----+
|  Rose  | Chihuahua |  11 |
| Piggy  |   Corgi   |  9  |
| River  |   Husky   |  7  |
| Archer |  Pitbull  |  8  |
+--------+-----------+-----+
 * sqlite:///basics.db
Done.
+--------+---------+-----+
|  name  |  breed  | age |
+--------+---------+-----+
| Doggo  |  Husky  |  4  |
| Piggy  |  Corgi  |  9  |
| Maggie | Terrier |  4  |
+--------+---------+-----+

#### SQLite DBs using Python

---

In [30]:
# Accessing DBs 

import sqlite3

print(f'sqlite3 version : {sqlite3.sqlite_version}')

conn = sqlite3.connect('my_friends.db')

# create cursor object
c = conn.cursor()

# execte some sql
c.execute('CREATE TABLE IF NOT EXISTS friends (first_name TEXT, last_name TEXT, closeness INTEGER);')

# commit changes
conn.commit()
conn.close() # always close the connection at the end

%sql sqlite:///my_friends.db
%sql SELECT name FROM sqlite_master WHERE type ='table' AND name NOT LIKE 'sqlite_%';

sqlite3 version : 3.22.0
   sqlite:///basics.db
 * sqlite:///my_friends.db
Done.

[('friends',)]

In [77]:
# Inserting into DBs

%sql sqlite:///my_friends.db
%sql DELETE FROM friends; -- deletes all the data in table

import sqlite3

conn = sqlite3.connect('my_friends.db')
c = conn.cursor()
c.execute('CREATE TABLE IF NOT EXISTS friends (first_name TEXT, last_name TEXT, closeness INTEGER);')
insert_query = '''INSERT INTO friends 
                    VALUES ("Merryweather","Lewis",7);'''
c.execute(insert_query)
conn.commit()
conn.close() 
a = %sql SELECT * FROM friends;
print(a)

print()

conn = sqlite3.connect('my_friends.db')
c = conn.cursor()
c.execute('CREATE TABLE IF NOT EXISTS friends (first_name TEXT, last_name TEXT, closeness INTEGER);')

form_first = 'Mary-Todd'
query = 'INSERT INTO friends (first_name) VALUES (?);' # no need of f-string anymore
c.execute(query,(form_first,)) # the values have to be given inside of a tuple,  else it will iterate over the contents of values

conn.commit()
conn.close() 
a = %sql SELECT * FROM friends;
print(a)

print()

conn = sqlite3.connect('my_friends.db')
c = conn.cursor()
c.execute('CREATE TABLE IF NOT EXISTS friends (first_name TEXT, last_name TEXT, closeness INTEGER);')

data = ('Steve','Irwin',9)
query = 'INSERT INTO friends VALUES (?,?,?);'
c.execute(query,data)

conn.commit()
conn.close() 
a = %sql SELECT * FROM friends;
print(a)

   sqlite:///basics.db
 * sqlite:///my_friends.db
9 rows affected.
   sqlite:///basics.db
 * sqlite:///my_friends.db
Done.
+--------------+-----------+-----------+
|  first_name  | last_name | closeness |
+--------------+-----------+-----------+
| Merryweather |   Lewis   |     7     |
+--------------+-----------+-----------+

   sqlite:///basics.db
 * sqlite:///my_friends.db
Done.
+--------------+-----------+-----------+
|  first_name  | last_name | closeness |
+--------------+-----------+-----------+
| Merryweather |   Lewis   |     7     |
|  Mary-Todd   |    None   |    None   |
+--------------+-----------+-----------+

   sqlite:///basics.db
 * sqlite:///my_friends.db
Done.
+--------------+-----------+-----------+
|  first_name  | last_name | closeness |
+--------------+-----------+-----------+
| Merryweather |   Lewis   |     7     |
|  Mary-Todd   |    None   |    None   |
|    Steve     |   Irwin   |     9     |
+--------------+-----------+-----------+

In [78]:
# Bulk inserts with Python

import sqlite3

conn = sqlite3.connect('my_friends.db')
c = conn.cursor()

people = [
    ('Ronald','Amundsen',5),
    ('Rosa','Parks',8),
    ('Henry','Hudson',7),
    ('Neil','Armstrong',7),
    ('Daniel','Boone',3)
]

#for person in people:
#  query = 'INSERT INTO friends VALUES (?,?,?);'
#  c.execute(query,person)

query = 'INSERT INTO friends VALUES (?,?,?);'
c.executemany(query,people)

conn.commit()
conn.close()
a = %sql SELECT * FROM friends;
print(a)

   sqlite:///basics.db
 * sqlite:///my_friends.db
Done.
+--------------+-----------+-----------+
|  first_name  | last_name | closeness |
+--------------+-----------+-----------+
| Merryweather |   Lewis   |     7     |
|  Mary-Todd   |    None   |    None   |
|    Steve     |   Irwin   |     9     |
|    Ronald    |  Amundsen |     5     |
|     Rosa     |   Parks   |     8     |
|    Henry     |   Hudson  |     7     |
|     Neil     | Armstrong |     7     |
|    Daniel    |   Boone   |     3     |
+--------------+-----------+-----------+

In [79]:
# Selecting with Python

from pprint import pprint
import sqlite3

conn = sqlite3.connect('my_friends.db')
c = conn.cursor()

data = ('Robert','Irwin',9)
query = 'INSERT INTO friends VALUES (?,?,?);'
c.execute(query,data)

c.execute('SELECT * FROM friends;')
print(c) # returns an iterable cursor object containing all the table data
print(type(c))

for item in c:
  print(item) # iterating through each row of the returned object

print()

c.execute('SELECT * FROM friends;')
pprint(c.fetchall()) # returns the contents of table as a list

print()

c.execute('SELECT * FROM friends WHERE last_name IS "Irwin"')
print(c.fetchall()) # fetches all matches in a list of tuples
c.execute('SELECT * FROM friends WHERE last_name IS "Irwin"')
print(c.fetchone()) # fetches the first instance of the match in a tuple

print()

c.execute('SELECT * FROM friends WHERE closeness > 5 ORDER BY closeness') # sorts in ascending order of values in closeness column
pprint(c.fetchall())

conn.commit()
conn.close()
a = %sql SELECT * FROM friends;
print(a)

<sqlite3.Cursor object at 0x7fd4a162a030>
<class 'sqlite3.Cursor'>
('Merryweather', 'Lewis', 7)
('Mary-Todd', None, None)
('Steve', 'Irwin', 9)
('Ronald', 'Amundsen', 5)
('Rosa', 'Parks', 8)
('Henry', 'Hudson', 7)
('Neil', 'Armstrong', 7)
('Daniel', 'Boone', 3)
('Robert', 'Irwin', 9)

[('Merryweather', 'Lewis', 7),
 ('Mary-Todd', None, None),
 ('Steve', 'Irwin', 9),
 ('Ronald', 'Amundsen', 5),
 ('Rosa', 'Parks', 8),
 ('Henry', 'Hudson', 7),
 ('Neil', 'Armstrong', 7),
 ('Daniel', 'Boone', 3),
 ('Robert', 'Irwin', 9)]

[('Steve', 'Irwin', 9), ('Robert', 'Irwin', 9)]
('Steve', 'Irwin', 9)

[('Merryweather', 'Lewis', 7),
 ('Henry', 'Hudson', 7),
 ('Neil', 'Armstrong', 7),
 ('Rosa', 'Parks', 8),
 ('Steve', 'Irwin', 9),
 ('Robert', 'Irwin', 9)]
   sqlite:///basics.db
 * sqlite:///my_friends.db
Done.
+--------------+-----------+-----------+
|  first_name  | last_name | closeness |
+--------------+-----------+-----------+
| Merryweather |   Lewis   |     7     |
|  Mary-Todd   |    None   |    None   |
|    Steve     |   Irwin   |     9     |
|    Ronald    |  Amundsen |     5     |
|     Rosa     |   Parks   |     8     |
|    Henry     |   Hudson  |     7     |
|     Neil     | Armstrong |     7     |
|    Daniel    |   Boone   |     3     |
|    Robert    |   Irwin   |     9     |
+--------------+-----------+-----------+

In [9]:
# SQL Injection

import sqlite3

conn = sqlite3.connect('users.db')
c = conn.cursor()

c.execute('CREATE TABLE IF NOT EXISTS users (username TEXT, password TEXT);')

%sql sqlite:///users.db
%sql DELETE FROM users;

userdata = [
    ('someuser_64','QwErTy123'),
    ('loadedegg177','5Cr4MbL3D'),
    ('Jet','meow')
]

query = 'INSERT INTO users VALUES (?,?)'
c.executemany(query,userdata)

conn.commit()
conn.close()
a = %sql SELECT * FROM users;
print(a)

print()

  # Exploitation with SQL injections (malicious inputs)

conn = sqlite3.connect('users.db')
c = conn.cursor()

for i in range(3):
  u = input('Please enter your username : ')
  p = input('Please enter your password : ')

  query = f"SELECT * FROM users WHERE username = '{u}' AND password = '{p}'"
  c.execute(query)
  result = c.fetchone()

  if result:
    print('WELCOME BACK')
  else:
    print(f'LOGIN FAILED!...{2-i} attempts left')

conn.commit()
conn.close()

    # By inserting ' OR 1=1-- on the input, we insert into SQL the logic for bypassing the password check
    # ' - single quote refers to the end of password input, in this case password is empty string
    # OR 1=1 - statement infers to SQL a conditional with pseudo code - if entered_password OR 1=1 - where 1=1 is TRUE
    # -- comments out the trailing quote in the input
    # equivalent code - SELECT * FROM users WHERE username = 'Jet' AND password = '' OR 1=1--'
                      # SELECT * FROM users WHERE username = 'Jet' AND password = '' OR 1=1-- 

print()

  # Correct method 

conn = sqlite3.connect('users.db')
c = conn.cursor()

for i in range(3):
  u = input('Please enter your username : ')
  p = input('Please enter your password : ')

  query = "SELECT * FROM users WHERE username = ? AND password = ?"
  c.execute(query,(u,p))
  result = c.fetchone()

  if result:
    print('WELCOME BACK')
  else:
    print(f'LOGIN FAILED!...{2-i} attempts left')

conn.commit()
conn.close()

 * sqlite:///users.db
3 rows affected.
 * sqlite:///users.db
Done.
+--------------+-----------+
|   username   |  password |
+--------------+-----------+
| someuser_64  | QwErTy123 |
| loadedegg177 | 5Cr4MbL3D |
|     Jet      |    meow   |
+--------------+-----------+

Please enter your username : Jet
Please enter your password : meow
WELCOME BACK
Please enter your username : Jet
Please enter your password : fafsaasf
LOGIN FAILED!...1 attempts left
Please enter your username : Jet
Please enter your password : ' OR 1=1--
WELCOME BACK

Please enter your username : Jet
Please enter your password : meow
WELCOME BACK
Please enter your username : Jet
Please enter your password : gsdgdsg
LOGIN FAILED!...1 attempts left
Please enter your username : Jet
Please enter your password : ' OR 1=1--
LOGIN FAILED!...0 attempts left

In [90]:
# Scraping to a DB

import requests
import sqlite3
from bs4 import BeautifulSoup

def scraper(url):
  response = requests.get(url)
  data = response.text
  soup = BeautifulSoup(data,'html.parser')
  books = soup.select('.product_pod')
  book_data = []
  for book in books:
    book_data.append((get_title(book),get_rating(book),get_price(book),get_availability(book)))
  return save_to_db(book_data)

def get_title(book):
  return book.find_all('a')[1]['title'] # alternative - book.find('h3').find('a')['title']

def get_price(book):
  return float(book.find(class_='price_color').get_text().replace('Â£',''))

def get_rating(book):
  rating_dict = {'One':1,'Two':2,'Three':3,'Four':4,'Five':5}
  return rating_dict[book.find_all('p')[0]['class'][1]] # alternative - book.select('.star-rating')[0].get_attribute_list('class')[1]

def get_availability(book):
  return book.find(class_='instock availability').get_text().strip()

def save_to_db(book_data):
  conn = sqlite3.connect('books.db')
  c = conn.cursor()
  c.execute('CREATE TABLE IF NOT EXISTS books (title TEXT, rating INTEGER, price REAL, availability TEXT);')

  %load_ext sql
  %sql sqlite:///books.db
  %sql DELETE FROM books;

  query = 'INSERT INTO books VALUES (?,?,?,?);'
  c.executemany(query,book_data)
  
  conn.commit()
  conn.close()
  a = %sql SELECT * FROM books;
  return print(a)


scraper('https://books.toscrape.com/')

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
 * sqlite:///books.db
20 rows affected.
 * sqlite:///books.db
Done.
+------------------------------------------------------------------------------------------------+--------+-------+--------------+
|                                             title                                              | rating | price | availability |
+------------------------------------------------------------------------------------------------+--------+-------+--------------+
|                                      A Light in the Attic                                      |   3    | 51.77 |   In stock   |
|                                       Tipping the Velvet                                       |   1    | 53.74 |   In stock   |
|                                           Soumission                                           |   1    |  50.1 |   In stock   |
|                                         Sharp Objects                                          |   4    | 47.82 |   In stock   |
|                             Sapiens: A Brief History of Humankind                              |   5    | 54.23 |   In stock   |
|                                        The Requiem Red                                         |   1    | 22.65 |   In stock   |
|                       The Dirty Little Secrets of Getting Your Dream Job                       |   4    | 33.34 |   In stock   |
|    The Coming Woman: A Novel Based on the Life of the Infamous Feminist, Victoria Woodhull     |   3    | 17.93 |   In stock   |
| The Boys in the Boat: Nine Americans and Their Epic Quest for Gold at the 1936 Berlin Olympics |   4    |  22.6 |   In stock   |
|                                        The Black Maria                                         |   1    | 52.15 |   In stock   |
|                         Starving Hearts (Triangular Trade Trilogy, #1)                         |   2    | 13.99 |   In stock   |
|                                     Shakespeare's Sonnets                                      |   4    | 20.66 |   In stock   |
|                                          Set Me Free                                           |   5    | 17.46 |   In stock   |
|                    Scott Pilgrim's Precious Little Life (Scott Pilgrim #1)                     |   5    | 52.29 |   In stock   |
|                                   Rip it Up and Start Again                                    |   5    | 35.02 |   In stock   |
|       Our Band Could Be Your Life: Scenes from the American Indie Underground, 1981-1991       |   3    | 57.25 |   In stock   |
|                                              Olio                                              |   1    | 23.88 |   In stock   |
|                     Mesaerion: The Best Science Fiction Stories 1800-1849                      |   1    | 37.59 |   In stock   |
|                                  Libertarianism for Beginners                                  |   2    | 51.33 |   In stock   |
|                                    It's Only the Himalayas                                     |   2    | 45.17 |   In stock   |
+------------------------------------------------------------------------------------------------+--------+-------+--------------+